Revit 2027 API
Application.NewUV(Double, Double) Method
Creates a UV object representing coordinates in 2-space with supplied values.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV NewUV(
	double u,
	double v
)
Public Function NewUV (
	u As Double,
	v As Double
) As UV
public:
UV^ NewUV(
	double u,
	double v
)
member NewUV :
        u : float *
        v : float -> UV
Parameters
u Double
The first coordinate.
v Double
The second coordinate.
Return Value
UV
Exceptions
Exception | Condition
ArgumentException |  Thrown when setting an infinite number to the U or V property.
See Also
Reference
Application Class
NewUV Overload
Autodesk.Revit.Creation Namespace